{"keras_version": "1.1.0", "config": [{"config": {"name": "merge_1", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "layers": [{"config": [{"config": {"name": "convolution2d_1", "activation": "relu", "b_constraint": null, "W_constraint": null, "input_dtype": "float32", "border_mode": "valid", "W_regularizer": null, "nb_filter": 32, "activity_regularizer": null, "init": "normal", "b_regularizer": null, "nb_row": 5, "trainable": true, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5, "batch_input_shape": [null, 40, 80, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "border_mode": "same", "strides": [1, 1], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_2", "activation": "relu", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 48, "activity_regularizer": null, "init": "normal", "b_regularizer": null, "nb_row": 5, "trainable": true, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "border_mode": "same", "strides": [2, 2], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_3", "activation": "relu", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "init": "normal", "b_regularizer": null, "nb_row": 3, "trainable": true, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "border_mode": "same", "strides": [1, 1], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "normal", "name": "dense_1", "activation": "relu", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "output_dim": 10, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"init": "normal", "name": "dense_2", "activation": "relu", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "output_dim": 5, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "name": "dense_3", "activation": "linear", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "output_dim": 1, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"name": "convolution2d_4", "activation": "relu", "b_constraint": null, "W_constraint": null, "input_dtype": "float32", "border_mode": "valid", "W_regularizer": null, "nb_filter": 32, "activity_regularizer": null, "init": "normal", "b_regularizer": null, "nb_row": 5, "trainable": true, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5, "batch_input_shape": [null, 40, 80, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "tf", "border_mode": "same", "strides": [1, 1], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_5", "activation": "relu", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 48, "activity_regularizer": null, "init": "normal", "b_regularizer": null, "nb_row": 5, "trainable": true, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_5", "trainable": true, "dim_ordering": "tf", "border_mode": "same", "strides": [2, 2], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_6", "activation": "relu", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "init": "normal", "b_regularizer": null, "nb_row": 3, "trainable": true, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_6", "trainable": true, "dim_ordering": "tf", "border_mode": "same", "strides": [1, 1], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "normal", "name": "dense_4", "activation": "relu", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "output_dim": 10, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"init": "normal", "name": "dense_5", "activation": "relu", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "output_dim": 5, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "name": "dense_6", "activation": "linear", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "output_dim": 1, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "normal", "name": "dense_7", "activation": "tanh", "bias": true, "W_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activity_regularizer": null, "input_dim": 1, "output_dim": 512, "trainable": true, "b_constraint": null, "b_regularizer": null, "batch_input_shape": [null, 1]}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"init": "normal", "name": "dense_8", "activation": "tanh", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "output_dim": 32, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "name": "dense_9", "activation": "linear", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "output_dim": 1, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}], "output_shape_type": "raw"}, "class_name": "Merge"}, {"config": {"output_dim": 1, "name": "dense_10", "activation": "linear", "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}