{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "batch_input_shape": [null, 40, 80, 3], "input_dtype": "float32", "activation": "intensity_norm"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "batch_input_shape": [null, 40, 80, 3], "input_dtype": "float32", "nb_filter": 32, "nb_row": 5, "nb_col": 5, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [3, 3], "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "nb_filter": 36, "nb_row": 5, "nb_col": 5, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "nb_filter": 48, "nb_row": 5, "nb_col": 5, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [3, 3], "border_mode": "same", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "pool_size": [3, 3], "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 100, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 960}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "output_dim": 25, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 100}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 25}}]}, {"class_name": "Sequential", "config": [{"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "batch_input_shape": [null, 40, 80, 3], "input_dtype": "float32", "activation": "intensity_norm"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_6", "trainable": true, "batch_input_shape": [null, 40, 80, 3], "input_dtype": "float32", "nb_filter": 32, "nb_row": 5, "nb_col": 5, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "pool_size": [3, 3], "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_7", "trainable": true, "nb_filter": 36, "nb_row": 5, "nb_col": 5, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_8", "trainable": true, "nb_filter": 48, "nb_row": 5, "nb_col": 5, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "trainable": true, "pool_size": [3, 3], "border_mode": "same", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_9", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_10", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "normal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_6", "trainable": true, "pool_size": [3, 3], "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "output_dim": 100, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 960}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "output_dim": 25, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 100}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 25}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "batch_input_shape": [null, 1], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "tanh", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "output_dim": 32, "init": "normal", "activation": "tanh", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 32}}]}]}}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 3}}], "keras_version": "1.2.2"}